Repository: PureBasicCN/PureBasicPreference
Catalog: OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: #PB_Date_Year : Will add 'Value' Years to the date
zh_cn: #PB_Date_Year : Will add 'Value' Years to the date【以<年>为单位添加到日期】

source: #PB_PixelFormat_8Bits : 1 byte per pixel, palletised
zh_cn: #PB_PixelFormat_8Bits ： 1 个字节每个像素

source: #PB_SerialPort_DTR: set DTR signal status (value can be 0 or 1)
zh_cn: #PB_SerialPort_DTR︰ 设置 DTR 信号状态 （值可以是 0 或 1）

source: #PB_SerialPort_NoParity : No parity
zh_cn: #PB_SerialPort_NoParity : No parity 无校验

source: #PB_SerialPort_RI : Get RI signal status (0 or 1)
zh_cn: #PB_SerialPort_RI : 获取RI 信号状态 (0 或者 1)

source: #PB_SerialPort_RxOver: An input buffer overflow has occurred.
zh_cn: #PB_SerialPort_RxOver︰ 发生输入的缓冲区溢出。

source: #PB_Window_FrameCoordinate: x position of the window, including borders (default).
zh_cn: #PB_Window_FrameCoordinate: 窗口的x 位置，包括边框 （默认值） 。

source: #PB_Window_FrameCoordinate: y position of the window, including borders (default).
zh_cn: #PB_Window_FrameCoordinate: y 位置的窗口，包括边框 （默认值）。

source: #PB_Window_InnerCoordinate: width of the window inner area (where gadget can be added),
zh_cn: #PB_Window_InnerCoordinate︰ 窗口内区域 （在这里可以添加小工具）宽度

source: ; 'Angle' and 'Position' will be a float, as they didn't have a specified type
zh_cn: 'Angle' 和 'Position' 将是一个浮点数，因为他们没有指定类型

source: FANTAISIE SOFTWARE
zh_cn: PureBasic.CN

source: #PB_SerialPort_XoffReceived: Specifies whether transmission is waiting because the XOFF character was received.
zh_cn: #PB_SerialPort_XoffReceived︰ 指定传输是否正在等待，因为接收到 XOFF 字符。

source: #PB_SerialPort_XoffSent : Specifies whether transmission is waiting because the XOFF character was transmitted.
zh_cn: #PB_SerialPort_XoffSent ︰ 指定传输是否正在等待，因为 XOFF 字符被传送。

source: ; the form "01/07/2010"
zh_cn: ; 输出： "01/07/2010"

source: #PB_SerialPort_EOFSent: Specifies whether the end-of-file (EOF) character has been received.
zh_cn: #PB_SerialPort_EOFSent: 指定文件结束（EOF）字符已接收。

source: ; 32-bit RGB without reversed Y coordinate
zh_cn: ;32 位 RGB 不颠倒Y 坐标

source: PureBasic has been created for the beginner and expert alike.
zh_cn: PureBasic 针对初学者创建，同时也针对专业人士。.

source: ; 32-bit RGB, with or without reversed Y coordinate
zh_cn: ;32 位 RGB，有或无颠倒的 Y 坐标

source: #PB_AntialiasingMode_x2 : x2 fullscreen antialiasing (FSAA).
zh_cn: #PB_AntialiasingMode_x2 : x2 全屏反锯齿 (FSAA).

source: #PB_Date_Month : Will add 'Value' Months to the date
zh_cn: #PB_Date_Month : Will add 'Value' Months to the date【以<月>为单位添加到日期】

source: #PB_PixelFormat_15Bits : 2 bytes per pixel
zh_cn: #PB_PixelFormat_15Bits ： 2 个字节每个像素

source: #PB_SerialPort_DCD: Get DCD signal status (0 or 1)
zh_cn: #PB_SerialPort_DCD: 获取 DCD 信号状态 (0 或者 1)

source: #PB_SerialPort_EvenParity : Even parity
zh_cn: #PB_SerialPort_EvenParity : Even parity 偶校验

source: #PB_SerialPort_OverRun: A character-buffer overrun has occurred.
zh_cn: #PB_SerialPort_OverRun︰ 字符缓冲区溢出发生。

source: #PB_SerialPort_RTS: set RTS signal status (value can be 0 or 1)
zh_cn: #PB_SerialPort_RTS︰ 设置 RTS 信号状态 （值可以是 0 或 1）

source: #PB_Window_FrameCoordinate: width of the window, including borders.
zh_cn: #PB_Window_FrameCoordinate︰ 窗口包括边框的宽度。

source: #PB_Window_InnerCoordinate: x position of the window inner area (where gadget can be added),
zh_cn: #PB_Window_InnerCoordinate: x 窗口内区域 （在这里可以添加控件） 的位置

source: #PB_Window_InnerCoordinate: y position of the window inner area (where gadget can be added),
zh_cn: #PB_Window_InnerCoordinate: y 位置的窗口内区域 （在这里可以添加小工具），

source: #PB_AntialiasingMode_x4 : x4 fullscreen antialiasing (FSAA).
zh_cn: #PB_AntialiasingMode_x4 : x4 全屏反锯齿 (FSAA).

source: #PB_Date_Week : Will add 'Value' Weeks to the date
zh_cn: #PB_Date_Week : Will add 'Value' Weeks to the date【以<周>为单位添加到日期】

source: #PB_PixelFormat_16Bits : 2 bytes per pixel
zh_cn: #PB_PixelFormat_16Bits ： 2 个字节，每个像素

source: #PB_SerialPort_DSR: Get DSR signal status (0 or 1)
zh_cn: #PB_SerialPort_DSR: 获取 DSR 信号状态 (0 或者 1)

source: #PB_SerialPort_MarkParity : Mark parity
zh_cn: #PB_SerialPort_MarkParity : Mark parity 校验位始终为1

source: #PB_SerialPort_RxParity : The hardware detected a parity error.
zh_cn: #PB_SerialPort_RxParity ︰ 硬件检测到奇偶校验错误。

source: #PB_SerialPort_TXD: Set TXD signal status (value can be 0 or 1)
zh_cn: #PB_SerialPort_TXD︰ 设置的 TXD 信号状态 （值可以是 0 或 1）

source: #PB_UTF8 : the string will be written in UTF8 format.
zh_cn: #PB_UTF8 : 字符串将以 UTF8 格式写入.

source: #PB_AntialiasingMode_x6 : x6 fullscreen antialiasing (FSAA).
zh_cn: #PB_AntialiasingMode_x6 : x6 全屏反锯齿 (FSAA).

source: #PB_Date_Day : Will add 'Value' Days to the date
zh_cn: #PB_Date_Day : Will add 'Value' Days to the date【以<天>为单位添加到日期】

source: #PB_PixelFormat_24Bits_RGB : 3 bytes per pixel (RRGGBB)
zh_cn: #PB_PixelFormat_24Bits_RGB ： 3 个字节，每个像素 （RRGGBB）

source: #PB_SerialPort_CTS: Get CTS signal status (0 or 1)
zh_cn: #PB_SerialPort_CTS: 获取 CTS 信号状态 (0 或者 1)

source: #PB_SerialPort_Frame : The hardware detected a framing error.
zh_cn: #PB_SerialPort_Frame : 硬件检测到帧错误。

source: #PB_SerialPort_OddParity : Odd parity
zh_cn: #PB_SerialPort_OddParity : Odd parity 奇校验

source: #PB_SerialPort_XonCharacter : Character used for Xon/Xoff handshaking sequence (value can be between 1 and 255).
zh_cn: #PB_SerialPort_XonCharacter ︰ 用于 Xon/Xoff 握手顺序的字符 （值可以是 1 到 255 之间）。

source: #PB_Unicode : the string will be written in unicode (UTF16) format.
zh_cn: #PB_Unicode : 字符串将以 unicode (UTF16) 格式写入.

source: PureBasic is a new "high level" programming language based on established BASIC rules.
zh_cn: PureBasic是一个新的"高级" 编程语言 ,它基于已建立的BASIC 规则.

source: #PB_Date_Hour : Will add 'Value' Hours to the date
zh_cn: #PB_Date_Hour : Will add 'Value' Hours to the date【以<小时>为单位添加到日期】

source: #PB_PixelFormat_24Bits_BGR : 3 bytes per pixel (BBGGRR)
zh_cn: #PB_PixelFormat_24Bits_BGR ： 3 个字节，每个像素 （BBGGRR）

source: #PB_SerialPort_Break : The hardware detected a break condition.
zh_cn: #PB_SerialPort_Break : 硬件检测到中断条件。

source: #PB_SerialPort_SpaceParity: Space parity
zh_cn: #PB_SerialPort_SpaceParity: Space parity 校验位始终为0

source: #PB_SerialPort_XoffCharacter: Character used for Xon/Xoff handshaking sequence (value can be between 1 and 255).
zh_cn: #PB_SerialPort_XoffCharacter︰ 用于 Xon/Xoff 握手顺序的字符 （值可以是 1 到 255 之间）。

source: #PB_SerialPort_XonCharacter : Character used for Xon/Xoff handshaking sequence (between 1 and 255)
zh_cn: #PB_SerialPort_XonCharacter : 获取用于 Xon/Xoff 的握手顺序值 ( 1 到 255)

source: #PB_Date_Minute : Will add 'Value' Minutes to the date
zh_cn: #PB_Date_Minute : Will add 'Value' Minutes to the date【以<分钟>为单位添加到日期】

source: #PB_PixelFormat_32Bits_RGB : 4 bytes per pixel (RRGGBB)
zh_cn: #PB_PixelFormat_32Bits_RGB ： 4 个字节，每个像素 （RRGGBB）

source: #PB_SerialPort_TxFull : The application tried to transmit a character but the output buffer was full.
zh_cn: #PB_SerialPort_TxFull ︰ 应用程序尝试发送一个字符，但输出缓冲区已满。

source: #PB_SerialPort_XoffCharacter: Character used for Xon/Xoff handshaking sequence (between 1 and 255)
zh_cn: #PB_SerialPort_XoffCharacter: 获取用于 Xon/Xoff 的握手顺序值 ( 1 到 255)

source: ; 32-bit RGB with reversed Y coordinate
zh_cn: ;32 位 RGB 颠倒 Y 坐标

source: ; the form "Y=2010, M=01, D=07"
zh_cn: ; 输出： "Y=2010, M=01, D=07"

source: #PB_Date_Second : Will add 'Value' Seconds to the date
zh_cn: #PB_Date_Second : Will add 'Value' Seconds to the date【以<秒>为单位添加到日期】

source: #PB_PixelFormat_32Bits_BGR : 4 bytes per pixel (BBGGRR)
zh_cn: #PB_PixelFormat_32Bits_BGR ： 4 个字节，每个像素 （BBGGRR）

source: #PB_SerialPort_IOE : An I/O error occurred during communications with the device.
zh_cn: #PB_SerialPort_IOE ︰ 与设备在通信期间出现 I/O 错误。

source: #PB_PixelFormat_ReversedY : The Y-Coordinate of the output is reversed in memory (the bottom row is stored first).
zh_cn: #PB_PixelFormat_ReversedY ： Y 坐标输出的颠倒 （底部行先存储） 在内存中。

source: #PB_SerialPort_WaitingCTS : Specifies whether transmission is waiting for the CTS (clear-to-send) signal to be sent.
zh_cn: #PB_SerialPort_WaitingCTS ︰ 指定传输是否正在等待发送 CTS （清除发送） 信号。

source: #PB_SerialPort_WaitingDSR : Specifies whether transmission is waiting for the DSR (data-set-ready) signal to be sent.
zh_cn: #PB_SerialPort_WaitingDSR ︰ 指定传输是否正在等待发送 DSR （数据准备就绪） 信号。

source: #PB_SerialPort_WaitingRLSD : Specifies whether transmission is waiting for the RLSD (receive-line-signal-detect) signal to be sent.
zh_cn: #PB_SerialPort_WaitingRLSD ︰ 指定传输是否正在等待 RLSD （接收线信号检测） 发送的信号。

source: Don't search in Strings : Any match that is found inside a literal string (in " ") is ignored.
zh_cn: 忽略字串内部 ：这将忽略掉把有字符串内找到的所有匹配内容 (带 " "的字串)。

source: Search inside Selection only : Searches only the selected region of code.
zh_cn: 在选中内容中查找 ：只搜索选定的代码区域。

source: Case Sensitive : Only text that matches the exact case of the search word will be found.
zh_cn: 区分大小写 ：只有保证确切的搜索内容的情况下，匹配的文本才会被搜索到。

source: Whole Words only : Search for the given word as a whole word.
zh_cn: 全字匹配 ：搜索到的内容是指定的整个单词，而不是某个词的一部分。

source: Don't search in Comments : Any match that is found inside a comment is ignored.
zh_cn: 忽略注释内容 ：进行搜索时会将忽略掉注释内的搜索到的匹配内。容

source: === Characteristics === PureBasic is a native 32 bit and 64 bit BASIC compiler.
zh_cn: === 特点 === PureBasic 是一个原生 32 位 和 64 位 BASIC 编译器.

source: A "block mode" is also available where the new line simply gets the same indentation as the previous one.
zh_cn: “块模式”也可以在新的一行得到与上一个行代码相同的缩进.

source: A color table with common colors is available here.
zh_cn: 这里有一个通用的颜色参照表.

source: A debugger error will be raised.
zh_cn: 调试器错误将被提高。

source: A list of options is also displayed when you typed a structured variable or interface followed by a "\".
zh_cn: 当你输入一个结构变量或接口后跟一个“\”会自动显示其子类选项列表。

source: A mask string which defines how the date string is formatted.
zh_cn: 掩码字符串，该字符串定义了日期字符串格式化的方式，用于格式化日期

source: A negative value can be used to subtract a date.
zh_cn: 使用一个负数值可以用来减去日期.

source: A number of functions from older versions of PureBasic that have been removed from the package still exist for a while as a compatibility wrapper to allow older codes to be tested/ported more easily.
zh_cn: 为了方便对程序进行测试、移植更容易，已经从PureBasic中移除的旧版本的一些功能函数为了兼容将仍然可用一段时间。

source: A number to identify the new serial port.
zh_cn: 识别新串口的编码.

source: A number to identify the new window.
zh_cn: 标识新窗口的编码.

source: A powerful Visual Designer is included in the PureBasic package, and allows to build easily any kind of applications.
zh_cn: 一个强大的 Visual Designer包含在安装包中并且允许你创建任何种类的应用程序.

source: A project allows the management of multiple source codes and other related files in one place with quick access to the files through the project tool.
zh_cn: 一个工程项目允许管理多个源代码和其他相关文件，并可以通过工程工具进行统一的快速访问。

source: A session is created when the IDE launch, and is closed when the IDE quits.
zh_cn: 会话在IDE 启动事创建，IDE退出时关闭。

source: A table with ASCII codes is available here.
zh_cn: ASCII码表点这里查看。

source: A value of 0 means fully transparent and a value of 255 means fully opaque.
zh_cn: 零意味着完全透明，255意味着完全不透明。

source: A window is opened to show the build progress.
zh_cn: 将打开一个显示生成进度窗口。

source: A window will be opened displaying all warnings issued during compilation.
zh_cn: 编译过程中会弹出窗口并显示警告提示。

source: Accessing and updating data is done using SQL queries, therefore it is necessary to have an understanding of SQL syntax.
zh_cn: 访问和更新数据使用 SQL 查询，因此它完成的是必须了解 SQL 语法。

source: Add an amount of time to a date.
zh_cn: 给日期加一个时间.

source: Additional coder :
zh_cn: 文档翻译:

source: Additional colors can be added to the gradient with the GradientColor() command.
zh_cn: 添加渐变色请使用GradientColor（）命令。

source: Additional compilers for this option have to be configured in the preferences.
zh_cn: 此选项的附加编译器必须在preferences选项中配置。

source: Advanced Debug example
zh_cn: 高级Debug调试例子

source: Advanced Keywords
zh_cn: 高级关键词

source: After you have typed the beginning of a command, a list of possible matches to the word start you have just typed will be displayed.
zh_cn: 在你键入命令的开头几个字符后，一个以此匹配的关键字列表将会显示出来。

source: All
zh_cn: 所有

source: All graphics will be XOR'ed with the current background.
zh_cn: 所有的图形将 XOR'ed 与当前的背景。

source: All remaining opened serial ports are automatically closed when the program ends.
zh_cn: 当程序结束时，所有剩余的打开的串行端口都会自动关闭.

source: All tools are provided in the full package.
zh_cn: 完整包中提供了所有的工具。

source: Also the shortcut keys Ctrl+Tab and Ctrl+Shift+Tab can be used to jump to the next or previous open source file, respectively.
zh_cn: 此外快捷键 Ctrl + Tab 和 Ctrl + Shift + Tab 分别可以用于跳转到下一个或上一个打开的源文件中。

source: Also, console functions can be really helpful to debug a program by printing out some information to the console, without stopping the program flow.
zh_cn: 另外，控制台功能可以真正帮你在调试程序时打印出一些信息到控制台而不用停止程序。

source: André Beer
zh_cn: 漂流瓶儿

source: Another default fold keyword is ";{" and ";}".
zh_cn: 另一对折叠关键字是 ";{" 和 ";}".

source: Any characters printed after calling this function will use the new colors.
zh_cn: 调用此函数后控制台上打印的所有字符都将使用您新指定的颜色。

source: Any number of filters can be given separated by ",".
zh_cn: 可以使用“,”来对多种文件类型进行设定。

source: Any pixels drawn outside of this box will be clipped.
zh_cn: 任何绘制到封闭区域外绘制的像素将被裁剪。

source: Any text file will be loaded into the source-editing field.
zh_cn: 任何文本的文件将加载到源编辑字段。

source: Any text you print after calling this function will start from the specified coordinates.
zh_cn: 调用这个函数后，任何你要打印的字符都会从这个坐标开始。

source: Arrays, Lists & Structures
zh_cn: 数组，列表与结构

source: As with "Find/Replace", there are checkboxes to make the search more specific.
zh_cn: 如“查找/替换”一样，这里也有复选框，使搜索更加明确。

source: Auto complete:
zh_cn: 自动完成：

source: Basic Keywords
zh_cn: 基本关键词

source: Better still, you get the four versions of PureBasic (Amiga, Linux Windows and MacOS X) for the same price !
zh_cn: 更妙的是，同样的价格你会得到的四个版本的PureBasic（Amiga、Linu、Windows和MacOS X系统）的！

source: Bind an event to a callback.
zh_cn: 将事件绑定给回调.

source: Both colors are always 32-bit with alpha channel independent of the color depth of the output.
zh_cn: 这两种颜色总是32位带alpha通道独立输出的颜色深度。

source: Building a project from the command-line involves the same actions like at choosing the 'Build Target' or 'Build all Targets' from the compiler menu.
zh_cn: 在命令行生成项目时可以选择“构建目标”或“构建所有目标”，这个也可以在编译器菜单中选择。

source: By clicking again, the code will again be shown ("unfolded") again.
zh_cn: 再次点击，则代码将再次展开。

source: By clicking on "Replace All", all matches from the current position downwards will be replaced (unless "Search inside Selection only" is set).
zh_cn: 通过点击“全部替换”，从当前位置以下的所有匹配内容将被替换（除非勾选“在选中内容查找”设定）。

source: By clicking on the [-], you can hide ("fold") that section of source code to keep a better overview of larger source files.
zh_cn: 通过点击[ - ]，您可以隐藏（“折叠”）的源代码，来达到能更好的最大限度浏览源文件。

source: By default, it is saved at the end of the source code as a comment (invisible in the IDE).
zh_cn: 默认情况下，配置信息会被保存在源代码的结尾处（在IDE中不可见）。

source: By default, the IDE does not insert a real tab when pressing the Tab key, as many programmers see it as a bad thing to use real tabs in source code.
zh_cn: 默认情况下，按下 Tab 键时，开发环境并不会插入一个真正的 tab 制表符，因为很多程序员认为在源代码中插入 tab 制表符不是太好。

source: By enabling the "Replace with" checkbox, you go into replace mode.
zh_cn: 通过启用“替换为”复选框，你进入替换模式。

source: By enabling this option, you can define another file that will be the one sent to the compiler instead of this one.
zh_cn: 通过启用此选项，您可以定义将要发送给编译器的另一个文件，而不是当前文件。

source: By the same author, discover the new web client-side programming language
zh_cn: 相同的作者,探索新的WEB前端编程语言

source: Can I create commercial applications with PureBasic ?
zh_cn: 我使用PureBasic创建商业应用？

source: Can be a combination of the following values:
zh_cn: 可以是下列值的组合︰

source: Change the colors used by the text display.
zh_cn: 更改用来显示文本的颜色。

source: Changes the angular factor of the #Entity.
zh_cn: 改变#Entity的角度的系数。

source: Changes the console title to the specified string.
zh_cn: 更改控制台标题为指定的字符串。

source: Changes the default serial port timeouts.
zh_cn: 更改默认串行端口超时时间。

source: Changes the display of the cursor, which is the indicator used to show where the next displayed character will be drawn.
zh_cn: 更改光标的显示，该指示器将在设置之后显示字符时开始使用。 .

source: Changes the fullscreen antialiasing mode.
zh_cn: 更改全屏反锯齿模式.

source: Changes the specified serial port status.
zh_cn: 更改指定串行端口状态。

source: Checks if the content of the specified database column is null.
zh_cn: 检查指定的数据库列的内容是否为空。

source: Clears the whole console content using the current background color.
zh_cn: 使用当前背景色清除整个控制台内容。

source: Close the console previously opened with OpenConsole().
zh_cn: 使用OpenConsole()打开控制台窗口前请先关闭先前的控制台窗口。

source: Closes all currently opened sources.
zh_cn: 关闭所有当前打开源码。

source: Closes the currently active source code.
zh_cn: 关闭当前激活的源码.

source: Closes the serial port previously opened with OpenSerialPort().
zh_cn: 关闭先前使用函数 OpenSerialPort()打开的串行端口.

source: Color (optional)
zh_cn: Color (可选)

source: Command Index
zh_cn: 命令索引

source: Command help in the status bar:
zh_cn: 状态栏中命令帮助：

source: Command-line options for the IDE
zh_cn: IDE命令行选项

source: Compilation time is really fast.
zh_cn: 编译时间真的很快。

source: Compiler options for non-project files
zh_cn: 非项目文件编译器选项

source: Compiling is simple.
zh_cn: 编译程序其实很简单。

source: Compiling your programs
zh_cn: 编译你的程序

source: Contents of the "File" menu:
zh_cn: "文件"菜单内容:

source: Copy the selected part of the source code to the clipboard and remove it from the code.
zh_cn: 将源代码的选定部分复制到剪贴板，并将其删除。

source: Copy the selected text to the Clipboard without deleting it from the code.
zh_cn: 选定的文本复制到剪贴板，而不从代码中删除。

source: Copyright © 2015 Fantaisie Software
zh_cn: Copyright © 2016 PureBasic.CN

source: Cost
zh_cn: 价格

source: Cost per copy
zh_cn: 每个副本

source: Country
zh_cn: 国家

source: Create a new empty source code file.
zh_cn: 创建新的空源代码文件.

source: Ctrl+Home navigates to the beginning of the file and Ctrl+End to the End.
zh_cn: Ctrl+Home 会将光标定位到文件开头，按Ctrl +End 则将光标定位到文件结束。

source: Currently, 3 values are available:
zh_cn: 目前有三个值有效：

source: Customizing the IDE
zh_cn: 自定义 IDE

source: Database programming starts by initializing the database environment using UseODBCDatabase(), UseSQLiteDatabase(), and UsePostgreSQLDatabase().
zh_cn: 数据库编程开始前需要由UseODBCDatabase()、 UseSQLiteDatabase()和UsePostgreSQLDatabase()来初始化的数据库环境。

source: Debug output
zh_cn: Debug 调试输出

source: Default value is $11.
zh_cn: 默认值为 $11 。

source: Default value is $13.
zh_cn: 默认值为 $13 。

source: Default value is 10 ms.
zh_cn: 默认值为 10 毫秒。

source: Default value is 100 ms.
zh_cn: 默认值为 100 毫秒。

source: Define a bounding box that restricts all drawing to the current drawing output.
zh_cn: 在当前绘图输出中定义一个封闭区域限制所有绘图在它的范围之内。

source: Defines how the parity will be handled on the connection.
zh_cn: 定义通信如何处理奇偶性校验。

source: Defines the data length, in byte (usually 7 or 8).
zh_cn: 定义的数据长度，字节 （通常是 7 或 8） 。

source: Defines the size of the input buffer, in bytes.
zh_cn: 定义输入缓冲区的大小，以字节为单位。

source: Defines the size of the output buffer, in bytes.
zh_cn: 定义输出缓冲区的大小，以字节为单位。

source: Defines the speed of the serial connection and can be one of the following values:
zh_cn: 定义串口通信连接速度（波特率），可以是下列值之一︰

source: Depending of the graphic card, this command can have a severe impact on rendering performance.
zh_cn: 取决于图形卡，此命令可以对严重影响渲染性能。

source: Description
zh_cn: 概要

source: Do not display results where the search word is part of another word.
zh_cn: 如果搜索词是另一个词的一部分则不作为搜索结果。

source: Does PureBasic have a visual editor ?
zh_cn: PureBasic有可视化编辑器？

source: Double-clicking on a warning will display the file/line that caused the warning.
zh_cn: 双击警告信息将会显示导致警告的代码行。

source: Double-clicking on a word selects the whole word as usual.
zh_cn: 通常情况下在一个单词上双击鼠标用来选择整个单词。

source: Double-clicking on an entry in the result window opens that file in the IDE and jumps to the selected result line.
zh_cn: 双击结果窗口中的条目，开发环境 IDE 会打开该文件，并跳转到匹配代码行。

source: Double-clicking on source text:
zh_cn: 双击原码中的文本：

source: Download
zh_cn: 下载

source: Download the PureBasic compiler for AmigaOS
zh_cn: 下载 AmigaOS版本的PureBasic 编译器

source: Download the PureBasic compiler for Linux (x64 - 64 bit)
zh_cn: 下载 Linux (x64 - 64 bit) 版本的 PureBasic 编译器

source: Download the PureBasic compiler for Linux (x86 - 32 bit)
zh_cn: 下载Linux (x86 - 32 bit)版本的PureBasic编译器

source: Download the PureBasic compiler for Windows (x64 - 64 bits)
zh_cn: 下载 PureBasic Windows (x64 - 64 位)的编译器

source: Download the PureBasic compiler for Windows (x86 - 32 bits)
zh_cn: 下载PureBasic Windows (x86 - 32 位)的编译器

source: Download the PureBasic compiler for for MacOS X (Intel x64)
zh_cn: 下载 MacOS X (Intel x64)版本的PureBasic 编译器

source: Download the PureBasic compiler for for MacOS X (Intel x86)
zh_cn: 下载 MacOS X (Intel x86)版本的PureBasic

source: Draw a box of given dimensions on the current output.
zh_cn: 向当前输出中绘制一个指定大小的方框。

source: Draw a circle on the current output.
zh_cn: 在当前输出中绘制一个圆。

source: Drawing a line, a box, a circle or even text is considered a 2D rendering operation.
zh_cn: 画一条线,一个方块,一个圆或任何文本都被视为2D渲染操作.

source: Draws an image to the current drawing output using alpha-blending.
zh_cn: 绘制图像使用alpha混合当前绘图输出。

source: Each variable may have a default value directly assigned to it.
zh_cn: 每个变量可能具有直接分配给它的默认值。

source: Editor - Coloring
zh_cn: 编辑器 - 着色

source: Editor - Folding
zh_cn: 编辑器 - 折叠

source: Enables the XOR mode.
zh_cn: 启用 XOR 模式。

source: Escape closes the auto complete list at any time.
zh_cn: 在任何时候都可以通过ESC键关闭自动完成列表。

source: Example
zh_cn: 示例

source: Example:
zh_cn: 示例:

source: Experienced coders will have no problem gaining access to any of the legal OS structures or API objects and PureBasic even allows inline ASM.
zh_cn: 有经验的程序员可以访问任何已经定义的OS结构或APi函数，PureBasic甚至允许行内嵌汇编。

source: Fantaisie Software
zh_cn: PureBasic.CN

source: Fantaisie Software Official WebSite.
zh_cn: PureBasic.CN 官方网站.

source: Flags (optional)
zh_cn: Flags (可选)

source: Folding options:
zh_cn: 折叠选项：

source: Following is an explanation of the Items in the Edit menu.
zh_cn: 以下是在编辑菜单中的项目的说明。

source: For a detailed description of that see Customizing the IDE.
zh_cn: 详细说明，请参阅自定义 IDE。

source: For advanced programmers DeclareC is available and will declare the procedure using 'CDecl' instead of 'StandardCall' calling convention.
zh_cn: 针对高级程序员DeclareC是可用的并且将声明过程采用 'CDecl' 而不是 'StandardCall' 调用约定。

source: For an example of how the drawing buffer can be used to create a nice visual effect, take a look here:
zh_cn: 例如如何绘图缓冲区可用于创建一个很好的视觉效果的情况下，看看这里：

source: For an overview of them and how to configure them, see Built-in Tools.
zh_cn: 对于他们的概述，以及如何配置它们，请参阅内置工具 Built-in Tools。

source: For each read operation, this value is added to the product of the ReadTotalTimeoutMultiplier member and the requested number of bytes.
zh_cn: 对于每个读取操作，此值被添加到 ReadTotalTimeoutMultiplier 成员与所请求的字节数的乘积。

source: For each read operation, this value is multiplied by the requested number of bytes to be read.
zh_cn: 对于每个读操作，这个值乘以所需的字节数将被读取.

source: For each write operation, this value is added to the product of the WriteTotalTimeoutMultiplier member and the number of bytes to be written.
zh_cn: 对于每个写操作，此值被添加到 WriteTotalTimeoutMultiplier 成员和的字节数要写入的产品中。

source: For each write operation, this value is multiplied by the number of bytes to be written.
zh_cn: 对于每个写操作，此值乘以要写入的字节数。

source: For ease of ordering, you can safely use our secure online method.
zh_cn: 为了便于订购的，你可以放心地使用我们的安全的在线方法。

source: For example if you switch to a different line with the above Goto function, or with the Procedure Browser tool.
zh_cn: 例如，如果你使用跳转功能切换代码行，或者使用浏览器程序 Procedure Browser工具切换代码行。

source: For more information, refer to Windows's ODBC help document.
zh_cn: 更多的信息，请参阅 Windows 的 ODBC 帮助文档。

source: French Pure Basic forum
zh_cn: 法语 Pure BASIC 论坛

source: Frédéric Laboureur
zh_cn: 麦壳饼

source: Furthermore, the IDE has many extra editing features specific to programming or PureBasic.
zh_cn: 此外, IDE 开发环境有很多针对 PureBasic 编程的扩展功能。

source: General
zh_cn: 常规

source: General - Language
zh_cn: 常规 - 语言

source: General - Shortcuts
zh_cn: 常规 - 快捷方式

source: General - Themes
zh_cn: 常规 - 主题

source: General options:
zh_cn: 常规选项:

source: Generally yes.
zh_cn: 一般来说是的。
